{
	"title":"walkshed with no network analyst",
	"scope": "How to create a walkshed without netwoek analyst - I recently needed to calculate a walkshed 1 for a land use planning project for the city of Ashland in MA as part of my works at Metropolitan Area Planning Council. Since I did not have a network analyst, I tried finding any alternative way of figuring out a walkshed. This is the method I could come up with.", 
	"descri": " METHOD: I used Google Distance Matrix API and QGIS and calculated the walking distance and walking duration for properties (parcels) surrounding the point of origin, the result is this: the walkshed ended up being quite accurate since Google took care of issues such as the location of a building in a lot, unwalkable routes or roads, and so on. Usually, walksheds are calculated based on distance, which is measured by looking at a road network using a network analysis method. I that approach the walking distance is considered to be about half mile, however, what is a walkable distance itself might be also a question to ask. WHAT ARE THE STEPS: For doing this I first made a new layer of the centroids from the parcels, then calculated a latitude-longitude field of the centroid point. Then I exported the layer to a CSV table and added a new field origin and populated for all parcels with the latitude and longitude of the point that I wanted to be the origin of any walking trip. Then I passed each row of the table (each parcel) as a pair of origin/destinations to google’s distance matrix API and saved the results as duration in meters.",
	"challenges": "We initially wanted to make a project focused on bivariate choropleth maps, but we ended up focusing on the values/benefits of having an interactive legend in terms of how interactivity improves perception, particularly in case of choropleth map legends. We are relatively new to javascript programming, but we tried to make this in a way that a user could easily add it to any leafletjs map, could choose the number of classes as an argument, also choose two colors that get interpolated using chromajs. In order to make a comparison we made another version, in which we have disabled the interactivity of the legend trying to show the difference.", 
	"images":["api/wna1.png"]
}
